Revit 2025 API
SolidglassTransmittanceType Enumeration
 The enumerated type representing the permitted values for the asset property "SolidglassTransmittance" from the "SolidGlass" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum SolidglassTransmittanceType
Public Enumeration SolidglassTransmittanceType
public enum class SolidglassTransmittanceType
type SolidglassTransmittanceType
Members
Member name | Value | Description
Clear | 0
Green | 1
Gray | 2
Blue | 3
Bluegreen | 4
Bronze | 5
CustomColor | 6
See Also
Reference
Autodesk.Revit.DB.Visual Namespace